{"meta":{"title":"Pace Makers","subtitle":"This is Pace Makers blogging website.","description":"","author":"Pace Makers","url":"https://pace-makers.github.io","root":"/"},"pages":[],"posts":[{"title":"Why Indian Parents Don't Support Gaming?","slug":"Why-Indian-Parents-don-t-support-Gaming","date":"2021-05-26T08:52:10.000Z","updated":"2021-05-26T10:51:31.778Z","comments":true,"path":"2021/05/26/Why-Indian-Parents-don-t-support-Gaming/","link":"","permalink":"https://pace-makers.github.io/2021/05/26/Why-Indian-Parents-don-t-support-Gaming/","excerpt":"What is Gaming? The definition of Gaming!I am refering gaming here as in a professional gamer, or an esports athlete, etc. I’m talking about a real gamer who has passion to grow and win games and go pro. Now to answer this question we need to understand it by the perspective of a typical parent in India. There are many reasons behind this and I am listing them below. The History","text":"What is Gaming? The definition of Gaming!I am refering gaming here as in a professional gamer, or an esports athlete, etc. I’m talking about a real gamer who has passion to grow and win games and go pro. Now to answer this question we need to understand it by the perspective of a typical parent in India. There are many reasons behind this and I am listing them below. The History As a developing country, earlier we(Indians) didnt have the privelege to choose our jobs. Those who studied and became engineer, doctor, etc were the only successful people in India. So our parents when they were younger were told the same things as we are told. Our parents unlike us, used to play outdoor games. So their parents told them that this is waste of time. Instead they should read books and study in that time to become successful. Studying was the only option to become successful. That’s why our parents tell us that gaming is waste of time and instead we should study and become successful. The UnawarenessAs the times have changed now and many Indian gamers are emerging and representing our country internationally, there is a small amount of scope in gaming. It is not fully changed, but to some extent it has changed. And our parents still think that this is a waste of time. We have to let them know about the current situation and convince them. Gaming is expensive! As we all know gaming in India is “EXPENSIVE”. And by expensive I mean very expensive (as compared to other countries). Most of the parents can’t afford these expensive graphic cards, gaming consoles, Processors, good peripherals, etc. Even the games are also quite expensive. So when we go to our parents and tell them that we want a pc/console, we are putting burden on them (as most families are middle class and cannot afford). Also as we are pursuing gaming as a career, it is seen as an investment. So parents are scared if they didn’t get the return and all their money got wasted. Toxicity in India Gaming! If you tell your parents you want to pursue gaming as profession, they might do a bit of R&amp;D on gaming. And what they would find in the Indian gaming community you know very well. “Toxicity”. Yes Indian gaming community is toxic. When I play Valorant or Pubg mobile and queue solo, I mute all the teammates most of the time. Because either they will try to demotivate you or sabotage you in game. That is not entirely their fault. Our famous gaming youtubers use abusive language on their streams and people enjoy it follow them. And parents are afraid of that toxicity, aggression, etc. That is also a major reason of not supporting gaming in India. Success is not guaranteed! Gaming is like entrepreneurship. Success is not guaranteed. And parents are concerned about their children and their future. As we discussed in history, entreprenuership was also not considered a good thing earlier. As a poor country parents wanted guranteed success for their children, and hence wanted their children to get a good job and settle accordingly. Therefore our parents want the same for us, i.e, get a good job and settle your life, instead of take risks and set up a business (here gaming). Solution For the Gamers When you were younger, could not walk by yourself, couldn’t speak, everything was taught to you by your parents. So why can’t you explain everything to them with kind and polite words instead of arguing and demanding pcs and consoles. You have to take all their questions and answer them by expaining everything. You have to assure them by studying side by side and gaming when you are free. I know gaming takes time, but for your parents you have to split time and do all the things side by side gaming. You can start a little earning and build a pc by yourself (ofcourse you can take some help of money from parents but try not to put burden on them). Just as your parents sacrificed many things for you, you can sacrifice some things and study/work side by side gaming to assure them. You have to convince them that every gamer is not the same, and every gamer is not toxic. Try to understand them, they are your parents, if you’ll try a little they will understand you completely. Build trust and never break it. Be honest with yourself. Good luck with your future I hope you and me both succeed together in life. Thank You for reading my blog! Follow me on Instagram - https://instagram.com/raunaq_sonejaFor gaming content subscribe to my Youtube Channel - https://www.youtube.com/channel/UCB5W2a5sH6LiS7Uv73Dls7wFollow me on twitter - https://twitter.com/raunaq_soneja","categories":[{"name":"Gaming","slug":"Gaming","permalink":"https://pace-makers.github.io/categories/Gaming/"},{"name":"Future","slug":"Gaming/Future","permalink":"https://pace-makers.github.io/categories/Gaming/Future/"},{"name":"Career","slug":"Gaming/Future/Career","permalink":"https://pace-makers.github.io/categories/Gaming/Future/Career/"},{"name":"Business","slug":"Gaming/Future/Career/Business","permalink":"https://pace-makers.github.io/categories/Gaming/Future/Career/Business/"},{"name":"Entreprenuership","slug":"Gaming/Future/Career/Business/Entreprenuership","permalink":"https://pace-makers.github.io/categories/Gaming/Future/Career/Business/Entreprenuership/"}],"tags":[{"name":"Gaming","slug":"Gaming","permalink":"https://pace-makers.github.io/tags/Gaming/"},{"name":"Indian","slug":"Indian","permalink":"https://pace-makers.github.io/tags/Indian/"},{"name":"Parents","slug":"Parents","permalink":"https://pace-makers.github.io/tags/Parents/"},{"name":"Money","slug":"Money","permalink":"https://pace-makers.github.io/tags/Money/"},{"name":"Game","slug":"Game","permalink":"https://pace-makers.github.io/tags/Game/"}]},{"title":"Create Bot for You Discord Server","slug":"create-bot-for-discord-server","date":"2021-05-26T08:32:17.000Z","updated":"2021-05-26T08:33:44.213Z","comments":true,"path":"2021/05/26/create-bot-for-discord-server/","link":"","permalink":"https://pace-makers.github.io/2021/05/26/create-bot-for-discord-server/","excerpt":"What we need for this tutorial NodeJs and NPM installed discord.js dotenv Setting up projectCreate a folder named discord_bot and initialize a node project in that folder with npm init -y command. Now Let’s install some packages by typing this command npm i discord.js dotenv.","text":"What we need for this tutorial NodeJs and NPM installed discord.js dotenv Setting up projectCreate a folder named discord_bot and initialize a node project in that folder with npm init -y command. Now Let’s install some packages by typing this command npm i discord.js dotenv. Let’s create a file named .env. This file will contain our Environment variables like TOKEN and PREFIX for our bot. Let’s get our token for our discord bot. Go to Discord Developer Portal and Sign up if you haven’t already. Now open Applications tab and Click on New Application. Type a name and press Create. Now that you have created a application, Set it up by typing name and giving it a Profile Picture. Click on the Bot tab, and Copy the Token. Paste it in your .env file. Your file should look like this 12TOKEN=PASTE YOUR TOKEN HEREPREFIX=! Let’s invite our bot to our server by going to OAuth2 tab and giving it scope of bot and permission of Administrator, Copy the url and paste it in your Browser, Now select your server and Press Continue. Now we are setup to create our Discord bot. Logging in to our botCreate index.js file inside your project and start typing your code. 12345678require(&quot;dotenv&quot;).config(); // Telling Nodejs, We are using dotenv to get environment variablesconst discord = require(&quot;discord.js&quot;); // Importing discord.js libraryconst client = new discord.Client(); // Creating a client for our botconst fs = require(&quot;fs&quot;); // We are gonna need filesystem module for later.// Your CODE WILL GO HEREclient.login(process.env.TOKEN); // Login into your discord bot you created by this method and passing it the token Let’s listen to the ready event (it fires when our bot is ready to use). 12345678910require(&quot;dotenv&quot;).config(); // Telling Nodejs, We are using dotenv to get environment variablesconst discord = require(&quot;discord.js&quot;); // Importing discord.js libraryconst client = new discord.Client(); // Creating a client for our botconst fs = require(&quot;fs&quot;); // We are gonna need filesystem module for later.client.on(&#x27;ready&#x27;, () =&gt; &#123; console.log(&quot;Hello World!&quot;);&#125;);client.login(process.env.TOKEN); // Login into your discord bot you created by this method and passing it the token Now if you run your bot by typing nodemon index in your powershell. You will see Hello World! logged into your terminal. Creating commandsTo create commands, create directory named commands in your project. Let’s create a basic command ping for our bot.Create file named ping in our commands directory. 123456789101112131415161718192021// Importing Message data type from `discord.js`const &#123; Message &#125; = require(&quot;discord.js&quot;);/* Exporting a object with name, description and execute properties. 1. name - this will be the name of the commands and used to call the commands 2. description - This will be helpful for getting help message. 3. execute - This will contain the function of the command. message and args will be passed to it.*/module.exports = &#123; name: &quot;ping&quot;, description: &quot;Gets the ping of the Bot.&quot;, execute: (message, args) =&gt; &#123; // Creating a new message const msg = new Message(); // Setting content of the message to &#x27;Pong!&#x27; msg.content = &quot;Pong!&quot;; // Sending the message to the current channel message.channel.send(msg); &#125;&#125; You can add more commands as you desire, like this. Executing commandsWe are gonna listen for messages on any channel of the server and see that message is starting with our PREFIX we used in our .env file. For this we are gonna listen for message event (This event fires whenever there is a new message). 123456789101112131415161718192021require(&quot;dotenv&quot;).config(); // Telling Nodejs, We are using dotenv to get environment variablesconst discord = require(&quot;discord.js&quot;); // Importing discord.js libraryconst client = new discord.Client(); // Creating a client for our botconst fs = require(&quot;fs&quot;); // We are gonna need filesystem module for later.client.on(&#x27;ready&#x27;, () =&gt; &#123; console.log(&quot;Hello World!&quot;);&#125;);client.on(&quot;message&quot;, (message) =&gt; &#123; // If message doesn&#x27;t start with our prefix and author of that message is a bot, we are gonna break the execution any further if (!message.content.startsWith(process.env.PREFIX) || message.author.bot) return; // Removing prefix, Getting command and arguments const args = message.content.slice(process.env.PREFIX.length).split(/ +/); const command = args.shift().toLowerCase(); // Getting command name.&#125;);client.login(process.env.TOKEN); // Login into your discord bot you created by this method and passing it the token Now we have our command and arguments that were called with message. We can create commands.To Do this, First we’re gonna make some changes to our ready event listener. 12345678910111213141516client.on(&quot;ready&quot;, () =&gt; &#123; console.log(&quot;Hello World!&quot;); // Creating new Collection Datatype from discord.js(You can learn about it from the documentation of discord.js) client.commands = new discord.Collection(); // Getting all file names with extension of `.js` in the `commands` directory const commandFiles = fs .readdirSync(&quot;./commands/&quot;) .filter((file) =&gt; file.endsWith(&quot;.js&quot;)); // Looping through the file and getting all the commands from it and setting it by name and command. for (const file of commandFiles) &#123; const command = require(`./commands/$&#123;file&#125;`); client.commands.set(command.name, command); &#125;&#125;); Now changing our message event to execute the command. 12345678910111213141516client.on(&quot;message&quot;, (message) =&gt; &#123; if (!message.content.startsWith(process.env.PREFIX) || message.author.bot) return; const args = message.content.slice(process.env.PREFIX.length).split(/ +/); const command = args.shift().toLowerCase(); // Checking if command exist it, if it does, calling execute function. Else sending error message to the channel where the command was called from. if (client.commands.has(command)) &#123; client.commands.get(command).execute(message, args); &#125; else &#123; message.channel.send( `No command named **$&#123;command&#125;** is found. Type **help** for all commands.` ); &#125;&#125;); If you send a message to the server, It will result in command being executed. Creating help commandTo create help command, create a file named help.js in the commands directory. 123456789101112131415161718192021222324252627282930313233343536373839// Importing Message embed data typeconst &#123; MessageEmbed &#125; = require(&quot;discord.js&quot;);// Importing Filesystem moduleconst fs = require(&quot;fs&quot;);module.exports = &#123; name: &quot;help&quot;, description: &quot;Help command gives you the information about the commands&quot;, execute: function (message, args) &#123; // Instantiating new MessageEmbed const embed = new MessageEmbed(); // Setting title and description of the embed embed.setTitle(&quot;Help&quot;); embed.setDescription(&quot;Type help &lt;command&gt; to get help for the command&quot;); // If no command specified after !help then execute this. if (args.length &lt; 1) &#123; // Reading all the commands const commandFiles = fs .readdirSync(&quot;./commands/&quot;) .filter((file) =&gt; file.endsWith(&quot;.js&quot;)); for (const file of commandFiles) &#123; const command = require(`./$&#123;file&#125;`); // Adding to the embed command name and its description embed.addField(command.name, command.description, true); &#125; &#125; else &#123; const command = require(`./$&#123;args[0]&#125;.js`); if (!command) &#123; return message.channel.send(&quot;No command found&quot;); &#125; embed.addField(command.name, command.description, true); &#125; // Sending the embed to the channel. message.channel.send(embed); &#125;,&#125;; Now if you type !help or !help command then it will be executed. To run this bot 24/7, You need to host it on a hosting provider like heroku, Digital Ocean or Google Cloud. Link to the Project Follow me on my socials.","categories":[{"name":"technology","slug":"technology","permalink":"https://pace-makers.github.io/categories/technology/"},{"name":"programming","slug":"technology/programming","permalink":"https://pace-makers.github.io/categories/technology/programming/"}],"tags":[{"name":"nodejs","slug":"nodejs","permalink":"https://pace-makers.github.io/tags/nodejs/"},{"name":"javascript","slug":"javascript","permalink":"https://pace-makers.github.io/tags/javascript/"},{"name":"discord","slug":"discord","permalink":"https://pace-makers.github.io/tags/discord/"},{"name":"bot","slug":"bot","permalink":"https://pace-makers.github.io/tags/bot/"},{"name":"commands","slug":"commands","permalink":"https://pace-makers.github.io/tags/commands/"}]},{"title":"Haircare Routine That Makes Your Hairs Look AWESOME","slug":"Haircare-routine","date":"2021-05-25T05:59:37.000Z","updated":"2021-05-26T08:34:09.526Z","comments":true,"path":"2021/05/25/Haircare-routine/","link":"","permalink":"https://pace-makers.github.io/2021/05/25/Haircare-routine/","excerpt":"So basically this article comes under the fashion and personal blogs. This is for all about our personal hygiene and daily routine therefore, whether you have any kind of hairs frizzy, curly, dry or like or fatigue ends you may get your required solution. Now, it’s been almost one year since I’m growing my hair so I have faced a lot of difficulties from managing my hairs to looks, to my social life. Everyone have some thought process on you as I am a boy so some of your social circle don’t like it that u have long hairs, will demotivate you. If you have such REAL goals just like me then u will definetly going to neglect these part of your life and surely in the end you willacheive what you actually wanted. Long hairs will definetly boost your confidence to stand over any other problems too cause u know the patience and hard work behind those days. Certainly you will feel good and you will be full of positivity, Now I will give you “MY HAIR ROUTINE PLAN” How I managed my hair all and every tips. I will post my image too to make you assure that you at the end will make it out any how, and if you don’t prefer long hairs then too its good to follow these steps so you have good and healthy hairs. MY ROUTINE","text":"So basically this article comes under the fashion and personal blogs. This is for all about our personal hygiene and daily routine therefore, whether you have any kind of hairs frizzy, curly, dry or like or fatigue ends you may get your required solution. Now, it’s been almost one year since I’m growing my hair so I have faced a lot of difficulties from managing my hairs to looks, to my social life. Everyone have some thought process on you as I am a boy so some of your social circle don’t like it that u have long hairs, will demotivate you. If you have such REAL goals just like me then u will definetly going to neglect these part of your life and surely in the end you willacheive what you actually wanted. Long hairs will definetly boost your confidence to stand over any other problems too cause u know the patience and hard work behind those days. Certainly you will feel good and you will be full of positivity, Now I will give you “MY HAIR ROUTINE PLAN” How I managed my hair all and every tips. I will post my image too to make you assure that you at the end will make it out any how, and if you don’t prefer long hairs then too its good to follow these steps so you have good and healthy hairs. MY ROUTINEstarting with basics, HOW TO WASH YOUR HAIR? Just don’t go rough with your hairs take some shampoo wash with care and gently by massaging on your scalp and soaking shampoo on your roots. After that you can put some hair conditioner on your tips of hairs so they become smoother and frizz free .Yes there are chances that as gradual as your hairs grow they start falling too. So I will provide you some links to the products which give awesome result try it surely you will get results. Just tap on the images above for checkout. NEXT, Dry out. Soak your hairs with towel and let it dry by 1 hour they will be dried. Till then you can play game or do anything else, if you are in hurry you can dry with hair dryer with normal temprature. After that you can use serum to make it work for full day unruly hairs, there are different kind of serums so you can choose by your hair type. some tips, comb your hair twice a day morning and in evening and while going to sleep you can massage your scalp. I’m using coconut oil or khadi onion hair oil twice or thrice weekly after 2nd day of wash. Don’t always let your hair tied up this will cause you headache or may be some hair fall too. you can also apply homemade hair mask twice weekly. In next blog I will likely to provide you few home-made hair masks. Have a good day.","categories":[],"tags":[]},{"title":"Black Fungus - What Is Mucormycosis, Its Symptoms and Treatment?","slug":"truth-about-black-fungus","date":"2021-05-23T07:47:57.000Z","updated":"2021-05-23T07:55:46.778Z","comments":true,"path":"2021/05/23/truth-about-black-fungus/","link":"","permalink":"https://pace-makers.github.io/2021/05/23/truth-about-black-fungus/","excerpt":"What is Mucormycosis?Mucormycosis is also known as Black fungus is a rare but dangerous fungual infection among covid19 patients, which often manifests in the skin and also affects the lungs and the brain. It is caused by a group of moulds known as mucormycetes present naturally in the environment. Black fungus infections have been detected in Karnataka, Uttarakhand, Telangana, Madhya Pradesh, Andhra Pradesh, Haryana and Bihar. States like Rajasthan have already declared this disease as an epidemic. How we come in contact with Black Fungus? Primarily, fungal spore floating in the environment give people this infection. One may also catch it when the fungus enters the skin through a cut, burn, or other types of skin trauma. If the fungus goes in through a cut or a burn, it can cause local infections. But if it goes in through the sinus, it can affect the eyes and eventually, the brain, leading to a fatal situation. Mucormycosis can lead to loss of the upper jaw and sometimes even the eye.","text":"What is Mucormycosis?Mucormycosis is also known as Black fungus is a rare but dangerous fungual infection among covid19 patients, which often manifests in the skin and also affects the lungs and the brain. It is caused by a group of moulds known as mucormycetes present naturally in the environment. Black fungus infections have been detected in Karnataka, Uttarakhand, Telangana, Madhya Pradesh, Andhra Pradesh, Haryana and Bihar. States like Rajasthan have already declared this disease as an epidemic. How we come in contact with Black Fungus? Primarily, fungal spore floating in the environment give people this infection. One may also catch it when the fungus enters the skin through a cut, burn, or other types of skin trauma. If the fungus goes in through a cut or a burn, it can cause local infections. But if it goes in through the sinus, it can affect the eyes and eventually, the brain, leading to a fatal situation. Mucormycosis can lead to loss of the upper jaw and sometimes even the eye. Symptoms of mucormycosis Some common symptoms include pain and redness around the eyes or nose, with fever, headache, coughing, shortness of breath, bloody vomits, and altered mental status. According to the Experts, this infection should be suspected when there is: nasal blockade or congestion, nasal discharge (blackish/bloody) Local pain on the cheek bone, one-sided facial pain, numbness or swelling Blackish discoloration over bridge of nose/palate Loosening of teeth, jaw involvement Blurred or double vision with pain Thrombosis, necrosis, skin lesion Chest pain, pleural effusion, worsening of respiratory symptoms. Treatment of mucormycosisIt is generally treated with antifungals but may require surgery. According to doctors, it is very important to control diabetes, reduce the use of steroids, and discontinue immunomodulating drugs. The initial recommended antifungal treatment is given through a vein(IV) for at least 4-6 weeks before infusion of amphotericin B and antifungal therapy.Currently, Amphotericin B is being used by doctors to treat black fungus but now, there is a shortage of Amphotericin B drugs, so doctors are moving to second-line drugs like Posaconazole. In severe cases, doctor may recommend surgery to remove infected or dead tissue to stop the fungus from spreading. This might include removing parts of your nose or eyes. Treating black fungus among patients, where it is undetected for long, requires a team of microbiologists, internal medicine specialists, intensivist neurologists, ENT specialists, ophthalmologists, dentists, surgeons, etc. Death Rate of MucormycosisResearchers estimate a mortality rate as high as 80% if left untreated for long but if treated, still the death rate is around 54%. Prevention Stay away from areas with a lot of dust or soil, like construction or evacuation site.Always wear a mask like N-95. Avoid infected water – floodwater or water-damaged buildings, especially after naturaldisasters like hurricanes or floods. If you have a weakened immune system, avoid activities that involve dust and soil, like gardening or yard work. After Covid-19 treatment , control diabetes and monitor blood glucose level. Thanks for Reading, Stay Safe.Follow me on Instagram Stay Tuned for more content","categories":[{"name":"health","slug":"health","permalink":"https://pace-makers.github.io/categories/health/"},{"name":"care","slug":"health/care","permalink":"https://pace-makers.github.io/categories/health/care/"}],"tags":[{"name":"blackfungus","slug":"blackfungus","permalink":"https://pace-makers.github.io/tags/blackfungus/"},{"name":"mucormycosis","slug":"mucormycosis","permalink":"https://pace-makers.github.io/tags/mucormycosis/"},{"name":"symptoms","slug":"symptoms","permalink":"https://pace-makers.github.io/tags/symptoms/"},{"name":"treatment","slug":"treatment","permalink":"https://pace-makers.github.io/tags/treatment/"},{"name":"deathrate","slug":"deathrate","permalink":"https://pace-makers.github.io/tags/deathrate/"},{"name":"prevention","slug":"prevention","permalink":"https://pace-makers.github.io/tags/prevention/"}]},{"title":"Covaxin vs CoviShield","slug":"Covaxin-vs-CoviShield","date":"2021-05-22T05:44:17.000Z","updated":"2021-05-22T09:07:19.473Z","comments":true,"path":"2021/05/22/Covaxin-vs-CoviShield/","link":"","permalink":"https://pace-makers.github.io/2021/05/22/Covaxin-vs-CoviShield/","excerpt":"Covaxin vs CovishieldIn this second wave of pandemic, we all are tensed about one thing, “The Covid Vaccine!”. And in India there are two vaccines available for the public, namely, Covaxin and Covishield. In this blog I will clear all your doubts regarding these two vaccines and I will help you judge which vaccine you should get. There are three types of vaccines:","text":"Covaxin vs CovishieldIn this second wave of pandemic, we all are tensed about one thing, “The Covid Vaccine!”. And in India there are two vaccines available for the public, namely, Covaxin and Covishield. In this blog I will clear all your doubts regarding these two vaccines and I will help you judge which vaccine you should get. There are three types of vaccines: Inactivated Vaccines Viral Vector Vaccines mRNA Vaccines Lets know about these 3 vaccines: Inactivated Vaccines Covaxin is an inactivated vaccine. In this vaccine, a virus is grown in a lab(in this case the coronavirus) and it is treated with a chemical to inactivate it. Now this virus is non-pathogenic and is inactivated. This virus is now used as a vaccine to develop anti-bodies. Viral Vector Vaccines Covishield from India and Sputnik V from Russia are the viral vector vaccines. In Covishield a chimpanzee adenovirus is used. The genetic material inside it is removed and substituted with genetic code of SARS COV 2. This virus acts a vector (like a mosquito) and it transfers the genetic code of SARS COV 2 so that our body can build immunity against it. mRNA VaccinesThe Pfizer and moderna vaccines are mRNA vaccines.mRNA means messenger RNA. The spike protein of the virus is use to extract the mRNA of the virus. This mRNA is used to make the vaccine and hence helps in development of anti-bodies. Covaxin vs CovishieldWe will try to differentiate these two vaccines on the basis of: Efficacy Dosage Gap Age of Beneficiaries Cost Availability Side Effects EfficacyBoth the vaccines have shown more than satisfactory results ever since the inoculation started in India.However, the efficacy of Covishield after the second dose can vary from 70-90% whereas of Covaxin it varies from 78-100%. Dosage GapThere is no difference between the two vaccines in terms of dosage. Both of them follow a two-dose regimen, administered 28 days apart. For Covishield, the interval between 1st and 2nd doses is 12-16 weeks. For Covaxin, the interval between the 2 doses is 4-6 weeks. Age of BeneficiariesCovishield has been approved for people aged 18 years and above, while Covaxin can be given to people aged 12 years and above. There, however, isn’t any assurance if the vaccine can be given to children and pregnant women. CostCovishield is less expensive. SII is selling this vaccine at INR 300 (government) and INR 600 (private centres).Covaxin is more expensive and is being sold at INR 400 (government) and INR 1200 (private facilities). AvailabilityCovishield is more easily available whereas there are only few hospitals and healthcare centres which are stocking Covaxin. Side EffectsAfter injecting the vaccine, you may experience pain at the site of injection. Some people also experience side effects such as headache, joint pain, may feel like feverish. These side effects do not persist for long and generally goes within a day or two. Side effects are almost same for both of them. Summing up the differences Covishield Covaxin The interval between 1st and 2nd doses is 12-16 weeks The interval between the 2 doses is 4-6 weeks Efficacy after the second dose can vary from 70-90% This vaccine can be 78-100% effective after the second dose People above 18 years of age can opt for this vaccine This vaccine can be injected into younger people as well (12 years and above) Covishield is less expensive. SII is selling this vaccine at INR 300 (government) and INR 600 (private centres) Covaxin is more expensive and is being sold at INR 400 (government) and INR 1200 (private facilities) Covishield is more easily available Fewer hospitals and healthcare centres are stocking Covaxin ConclusionIn my opinion, you should choose covaxin over covishield. As you have already read the differences apart from cost everything is better than covishield. I am not saying that covishield is not good or it is bad. As there is a shortage of vaccines in the country, one should get vaccinated with any one of these, but if you have choice go for Covaxin.And I forgot to mention Both vaccines are capable of handling all the incoming new strains of coronaviruses. Thank You for reading my blog! Follow me on Instagram - https://instagram.com/raunaq_sonejaFor gaming content subscribe to my Youtube Channel - https://www.youtube.com/channel/UCB5W2a5sH6LiS7Uv73Dls7wFollow me on twitter - https://twitter.com/raunaq_soneja","categories":[{"name":"Healthcare","slug":"Healthcare","permalink":"https://pace-makers.github.io/categories/Healthcare/"},{"name":"Coronavirus","slug":"Healthcare/Coronavirus","permalink":"https://pace-makers.github.io/categories/Healthcare/Coronavirus/"},{"name":"Vaccine","slug":"Healthcare/Coronavirus/Vaccine","permalink":"https://pace-makers.github.io/categories/Healthcare/Coronavirus/Vaccine/"}],"tags":[{"name":"covaxin","slug":"covaxin","permalink":"https://pace-makers.github.io/tags/covaxin/"},{"name":"covishield","slug":"covishield","permalink":"https://pace-makers.github.io/tags/covishield/"},{"name":"vaccine","slug":"vaccine","permalink":"https://pace-makers.github.io/tags/vaccine/"},{"name":"coronavirus","slug":"coronavirus","permalink":"https://pace-makers.github.io/tags/coronavirus/"},{"name":"corona vaccine","slug":"corona-vaccine","permalink":"https://pace-makers.github.io/tags/corona-vaccine/"},{"name":"vaccine center","slug":"vaccine-center","permalink":"https://pace-makers.github.io/tags/vaccine-center/"},{"name":"vaccine india","slug":"vaccine-india","permalink":"https://pace-makers.github.io/tags/vaccine-india/"},{"name":"pandemic","slug":"pandemic","permalink":"https://pace-makers.github.io/tags/pandemic/"}]},{"title":"How to Start Mining Bitcoin","slug":"How-to-start-mining-Bitcoin","date":"2021-05-21T14:47:24.000Z","updated":"2021-05-22T08:41:43.350Z","comments":true,"path":"2021/05/21/How-to-start-mining-Bitcoin/","link":"","permalink":"https://pace-makers.github.io/2021/05/21/How-to-start-mining-Bitcoin/","excerpt":"What we need for this tutorial Powerful Graphic card (GPU) Nvidia or AMD Bitcoin wallet Bitcoin Mining Software (Miner) Internet connection Setting up thingsWe will use here Nicehash wallet and Nicehash Miner here, because it is easy to use to setup.First we will setup Nicehash wallet.","text":"What we need for this tutorial Powerful Graphic card (GPU) Nvidia or AMD Bitcoin wallet Bitcoin Mining Software (Miner) Internet connection Setting up thingsWe will use here Nicehash wallet and Nicehash Miner here, because it is easy to use to setup.First we will setup Nicehash wallet. How to setup Nicehash wallet Go to https://www.nicehash.com/my/register Enter your details and Create a new account Verify your Email Address Now your account is sucessfully created Login to your account after first login it will show select services select the Cryptocurrency wallet , cryptocurrency mining &amp; cryptocurrency exchange Your wallet is Ready to use Time to setup miner How to setup Nicehash miner Go to https://www.nicehash.com/download-center Now click on download in front of Nicehash miner it will take you to another website of github click on Download nicehash miner installer After Downloading Nicehash miner install it. After installing Open the Nicehash miner and Login with your account Now it will download some file let it download all of them After this it will show some option to accept accept all the option and restart your Nicehash miner Now click on Start Mining it will take few minutes to test (For the first time only) We are successfully started mining bitcoin For more information about wallet and withdraw you can visit Nicehash website or Comment hereor You can ask me about it on instagram : https://www.instagram.com/hardc0d3d/","categories":[{"name":"technology","slug":"technology","permalink":"https://pace-makers.github.io/categories/technology/"},{"name":"cryptocurrency","slug":"technology/cryptocurrency","permalink":"https://pace-makers.github.io/categories/technology/cryptocurrency/"},{"name":"trading","slug":"technology/cryptocurrency/trading","permalink":"https://pace-makers.github.io/categories/technology/cryptocurrency/trading/"}],"tags":[{"name":"bitcoin","slug":"bitcoin","permalink":"https://pace-makers.github.io/tags/bitcoin/"},{"name":"bitcoinmining","slug":"bitcoinmining","permalink":"https://pace-makers.github.io/tags/bitcoinmining/"},{"name":"cryptocurrency","slug":"cryptocurrency","permalink":"https://pace-makers.github.io/tags/cryptocurrency/"},{"name":"blockchain","slug":"blockchain","permalink":"https://pace-makers.github.io/tags/blockchain/"},{"name":"btc","slug":"btc","permalink":"https://pace-makers.github.io/tags/btc/"},{"name":"bitcointrading","slug":"bitcointrading","permalink":"https://pace-makers.github.io/tags/bitcointrading/"},{"name":"investment","slug":"investment","permalink":"https://pace-makers.github.io/tags/investment/"}]},{"title":"Realtime Console Chat App","slug":"realtime-console-chat-app","date":"2021-05-21T07:42:24.000Z","updated":"2021-05-22T08:50:29.366Z","comments":true,"path":"2021/05/21/realtime-console-chat-app/","link":"","permalink":"https://pace-makers.github.io/2021/05/21/realtime-console-chat-app/","excerpt":"In this post, We will create and see how easy it is to create your own realtime chat app in console. This chat app is two part, One part is server and second part is Client. What we need for this tutorial NPM and NodeJS installed socket.io and socket.io-client module Setting up our project","text":"In this post, We will create and see how easy it is to create your own realtime chat app in console. This chat app is two part, One part is server and second part is Client. What we need for this tutorial NPM and NodeJS installed socket.io and socket.io-client module Setting up our projectI will be creating my server and client on the same project, If you want to deploy your server code to your hosting provider you need to create seperate project.First, I created a directory named chat-cli and initialized npm project with npm init -y. Now I installed the required modules like socket.io and socket.io-client with npm install socket.io socket.io-client.I created two files in our project index.js(contains Client code) and server.js(contains Server code).Now let’s dive into more details. Creating a Socket.io serverWe need socket.io server to process all events and send it to our client. So, Let’s create it. Open your server.js file and Let’s write some code. 123456789101112131415161718192021222324252627// Created a socket.io serverconst io = require(&quot;socket.io&quot;)();// This should be a free port on our server.const PORT = process.env.PORT || 3000;// Created a empty user object, This will store names of our users.const users = &#123;&#125;;// Listening for a connection event (This event fires when a client is connected to your server)io.on(&quot;connection&quot;, (socket) =&gt; &#123; console.log(&quot;New Connection: &quot; + socket.id); // If user emitted a `new user` event, This callback will be called with his name. socket.on(&#x27;new user&#x27;, (name) =&gt; &#123; // Storing his name users[socket.id] = name; // Emitting an event to all users except that user. socket.broadcast.emit(&quot;message&quot;, `$&#123;name&#125; joined the chat.`) &#125;); // Listening for a `message` event. socket.on(&#x27;message&#x27;, (text) =&gt; &#123; // Emitting an event to all users except that user. socket.broadcast.emit(&quot;message&quot;, `$&#123;users[socket.id]&#125;&gt; $&#123;text&#125;`); &#125;);&#125;);// Starting up server on PORTio.listen(PORT); Now our server code is finished. Creating Client for ServerWe need to create client and let it connect to our server. Open up index.js file and Let’s write some code. 1234567891011121314151617181920212223242526272829303132333435363738// IMPORTING `socket.io-client` moduleconst io = require(&#x27;socket.io-client&#x27;);// Creating client at the server, you need to pass url of your server where you hosted it.const socket = io(&quot;http://localhost:3000&quot;);// IMPORTING readline module to read from console.const readline = require(&#x27;readline&#x27;);// Creating an interface to get input from our console.const rl = readline.createInterface(&#123; input: process.stdin,&#125;);// Getting users name.console.log(&quot;What is your name?&quot;);rl.question(&quot;What is your name?&quot;, (text) =&gt; &#123; // Sending users name to server socket.emit(&#x27;new user&#x27;, text.trim()); console.log(&quot;You joined the chat&quot;); process.stdout.write(&quot;&gt; &quot;);&#125;);// Listening for event `message` from our server (This will fire when server sends `message` event)socket.on(&quot;message&quot;, (text) =&gt; &#123; // Erasing Last line process.stdout.write(&quot;\\r\\x1b[K&quot;) console.log(text); process.stdout.write(&quot;&gt; &quot;);&#125;);// Prompting user to enter message.rl.prompt();// Fires when we input text from user.rl.on(&#x27;line&#x27;, (text) =&gt; &#123; // Sending message to our server. socket.emit(&#x27;message&#x27;, text.trim()); process.stdout.write(&quot;&gt; &quot;); rl.prompt();&#125;); Our client code is now finished. How to runFirst open up three terminals or cmd in your project directory, Start your server first by typing node server.js. Now run two clients you want to chat by typing node index.js on two terminals or cmd. If you have done everything correctly, You will be able to chat. Link to This Project Follow me on my socials","categories":[{"name":"Technology","slug":"Technology","permalink":"https://pace-makers.github.io/categories/Technology/"},{"name":"Programming","slug":"Technology/Programming","permalink":"https://pace-makers.github.io/categories/Technology/Programming/"}],"tags":[{"name":"nodejs","slug":"nodejs","permalink":"https://pace-makers.github.io/tags/nodejs/"},{"name":"javascript","slug":"javascript","permalink":"https://pace-makers.github.io/tags/javascript/"},{"name":"socket","slug":"socket","permalink":"https://pace-makers.github.io/tags/socket/"}]},{"title":"Misconceptions About Vaccines","slug":"misconceptions-about-vaccines","date":"2021-05-20T07:42:48.000Z","updated":"2021-05-20T11:09:43.995Z","comments":true,"path":"2021/05/20/misconceptions-about-vaccines/","link":"","permalink":"https://pace-makers.github.io/2021/05/20/misconceptions-about-vaccines/","excerpt":"In these tough times we are facing a lot of problem which is enormous in number. The pandemic has no solution other than Vaccines. So, why people fear This? Some people think is it safe so?will it result cause in any other severe problems?….. So hold on guyss Read this full article and we assure you at the end you will get your answers. So basically starting with “What are Vaccines and How do they really Work?”A vaccine is a biological preparation that improves immunity to a particular disease caused by any virus or bacteria. Mostly vaccines contain parts of microbes or whole microbes that have been killed or weakened so that they don’t cause any disease.When a person is Vaccinated, the immune system confronts these harmless versions of the germs. The immune system quickly clears them from the body.In turn the body remembers the germ so that later if they attack again the retained memory help to fight against the particular germ and that’s how it work. Starting with whether covid vaccines are safe or not, So from my point of view and considering those recommendatoions from W.H.O. these vaccines are the only first and last option we have right now.These may cause you several mild-to-moderate side effects when receiving vaccinations. This is because your immune system is instructing your body to react in certain ways: it increases blood flow so more immune cells can circulate, and it raises your body temperature in order to kill the virus. So bascially you may expose to some mild fever, headache or some body pain. And no such long term side effects shown yet mostly. Don’t fear within 10-14 days your immune system start to develop again and sooner you will be all normal again.","text":"In these tough times we are facing a lot of problem which is enormous in number. The pandemic has no solution other than Vaccines. So, why people fear This? Some people think is it safe so?will it result cause in any other severe problems?….. So hold on guyss Read this full article and we assure you at the end you will get your answers. So basically starting with “What are Vaccines and How do they really Work?”A vaccine is a biological preparation that improves immunity to a particular disease caused by any virus or bacteria. Mostly vaccines contain parts of microbes or whole microbes that have been killed or weakened so that they don’t cause any disease.When a person is Vaccinated, the immune system confronts these harmless versions of the germs. The immune system quickly clears them from the body.In turn the body remembers the germ so that later if they attack again the retained memory help to fight against the particular germ and that’s how it work. Starting with whether covid vaccines are safe or not, So from my point of view and considering those recommendatoions from W.H.O. these vaccines are the only first and last option we have right now.These may cause you several mild-to-moderate side effects when receiving vaccinations. This is because your immune system is instructing your body to react in certain ways: it increases blood flow so more immune cells can circulate, and it raises your body temperature in order to kill the virus. So bascially you may expose to some mild fever, headache or some body pain. And no such long term side effects shown yet mostly. Don’t fear within 10-14 days your immune system start to develop again and sooner you will be all normal again. Who should get the covid-19 vaccines?The COVID- 19 vaacines are safe to most of the people which are older than 18n years,including those to which fall under these category : hypertension, diabetes, asthma, pulmonary, liver and kidney disease, as well as chronic infections that are stable and controlled. Can we stop taking precautions after being vaccinated?Vaccinations protect you from those uncontrollable situation which cause multiple failure of organs and deaths, after 14 daysit start building up immuntiy. In between this time peiod one should take care of himself atmost,because in this time your immunity will be at the lowest. After that it gradually increases.Still there are lot of discussion is going on and to be reamined in safer zone we still needto follow our local guidelines, which is probably wearing mask and maintaining social distanceof 1 meter. Can I have the second dose with a different vaccine?NO specific data shows to use this type of comnbination and till the date WHO do not recommendso probably, my answer is no. However if any records or some positive results will be shownwe will let you know in comments. After getting vaccine can I get RT- PCR or antigen test positive?No, the RT- PCR or antigen test will not show the report positive, However,because the COVID-19 vaccine prompts an immune response, it may be possible to test positive in an antibody (serology) test that measures COVID-19 immunity in an individual. Should I be vaccinated if I had COVID-19 positive?The US’ Centres for Disease Control and Prevention (CDC) recommends that a person get vaccinated immediately after recovery, while the World Health Organization (WHO) states that a person should wait six months as natural antibodies seem to likely persist in the human body until then. What happens if I take the vaccine when I’m positive?“We do not currently have any evidence to say whether it is better or worse to get vaccinated when infected, whether in terms of immune response or any safety issue,” says Dr Kang. However, vaccinating after recovery acts like a booster shot, with previously infected people making a very strong response with the first dose of vaccine. What if I catch Covid in between two vaccine doses?You should wait for 3-4 weeks after recovery before you take the second dose. Can pregnant/lactating women take the vaccine?No such side effects shown yet to those who were pregnant or lactating womens.Based on data, it appears safe for pregnant and lactating women to take the currently available vaccines, says Kang. How long after the Covid shots should I take other vaccines?This changes from vaccine to vaccine you should concerns your local authority for this. Hope you all get enough information about this topic if any related issues or query you have write me on those comment below.Have a good day","categories":[],"tags":[]}],"categories":[{"name":"Gaming","slug":"Gaming","permalink":"https://pace-makers.github.io/categories/Gaming/"},{"name":"Future","slug":"Gaming/Future","permalink":"https://pace-makers.github.io/categories/Gaming/Future/"},{"name":"Career","slug":"Gaming/Future/Career","permalink":"https://pace-makers.github.io/categories/Gaming/Future/Career/"},{"name":"Business","slug":"Gaming/Future/Career/Business","permalink":"https://pace-makers.github.io/categories/Gaming/Future/Career/Business/"},{"name":"Entreprenuership","slug":"Gaming/Future/Career/Business/Entreprenuership","permalink":"https://pace-makers.github.io/categories/Gaming/Future/Career/Business/Entreprenuership/"},{"name":"technology","slug":"technology","permalink":"https://pace-makers.github.io/categories/technology/"},{"name":"programming","slug":"technology/programming","permalink":"https://pace-makers.github.io/categories/technology/programming/"},{"name":"health","slug":"health","permalink":"https://pace-makers.github.io/categories/health/"},{"name":"care","slug":"health/care","permalink":"https://pace-makers.github.io/categories/health/care/"},{"name":"Healthcare","slug":"Healthcare","permalink":"https://pace-makers.github.io/categories/Healthcare/"},{"name":"Coronavirus","slug":"Healthcare/Coronavirus","permalink":"https://pace-makers.github.io/categories/Healthcare/Coronavirus/"},{"name":"Vaccine","slug":"Healthcare/Coronavirus/Vaccine","permalink":"https://pace-makers.github.io/categories/Healthcare/Coronavirus/Vaccine/"},{"name":"cryptocurrency","slug":"technology/cryptocurrency","permalink":"https://pace-makers.github.io/categories/technology/cryptocurrency/"},{"name":"trading","slug":"technology/cryptocurrency/trading","permalink":"https://pace-makers.github.io/categories/technology/cryptocurrency/trading/"},{"name":"Technology","slug":"Technology","permalink":"https://pace-makers.github.io/categories/Technology/"},{"name":"Programming","slug":"Technology/Programming","permalink":"https://pace-makers.github.io/categories/Technology/Programming/"}],"tags":[{"name":"Gaming","slug":"Gaming","permalink":"https://pace-makers.github.io/tags/Gaming/"},{"name":"Indian","slug":"Indian","permalink":"https://pace-makers.github.io/tags/Indian/"},{"name":"Parents","slug":"Parents","permalink":"https://pace-makers.github.io/tags/Parents/"},{"name":"Money","slug":"Money","permalink":"https://pace-makers.github.io/tags/Money/"},{"name":"Game","slug":"Game","permalink":"https://pace-makers.github.io/tags/Game/"},{"name":"nodejs","slug":"nodejs","permalink":"https://pace-makers.github.io/tags/nodejs/"},{"name":"javascript","slug":"javascript","permalink":"https://pace-makers.github.io/tags/javascript/"},{"name":"discord","slug":"discord","permalink":"https://pace-makers.github.io/tags/discord/"},{"name":"bot","slug":"bot","permalink":"https://pace-makers.github.io/tags/bot/"},{"name":"commands","slug":"commands","permalink":"https://pace-makers.github.io/tags/commands/"},{"name":"blackfungus","slug":"blackfungus","permalink":"https://pace-makers.github.io/tags/blackfungus/"},{"name":"mucormycosis","slug":"mucormycosis","permalink":"https://pace-makers.github.io/tags/mucormycosis/"},{"name":"symptoms","slug":"symptoms","permalink":"https://pace-makers.github.io/tags/symptoms/"},{"name":"treatment","slug":"treatment","permalink":"https://pace-makers.github.io/tags/treatment/"},{"name":"deathrate","slug":"deathrate","permalink":"https://pace-makers.github.io/tags/deathrate/"},{"name":"prevention","slug":"prevention","permalink":"https://pace-makers.github.io/tags/prevention/"},{"name":"covaxin","slug":"covaxin","permalink":"https://pace-makers.github.io/tags/covaxin/"},{"name":"covishield","slug":"covishield","permalink":"https://pace-makers.github.io/tags/covishield/"},{"name":"vaccine","slug":"vaccine","permalink":"https://pace-makers.github.io/tags/vaccine/"},{"name":"coronavirus","slug":"coronavirus","permalink":"https://pace-makers.github.io/tags/coronavirus/"},{"name":"corona vaccine","slug":"corona-vaccine","permalink":"https://pace-makers.github.io/tags/corona-vaccine/"},{"name":"vaccine center","slug":"vaccine-center","permalink":"https://pace-makers.github.io/tags/vaccine-center/"},{"name":"vaccine india","slug":"vaccine-india","permalink":"https://pace-makers.github.io/tags/vaccine-india/"},{"name":"pandemic","slug":"pandemic","permalink":"https://pace-makers.github.io/tags/pandemic/"},{"name":"bitcoin","slug":"bitcoin","permalink":"https://pace-makers.github.io/tags/bitcoin/"},{"name":"bitcoinmining","slug":"bitcoinmining","permalink":"https://pace-makers.github.io/tags/bitcoinmining/"},{"name":"cryptocurrency","slug":"cryptocurrency","permalink":"https://pace-makers.github.io/tags/cryptocurrency/"},{"name":"blockchain","slug":"blockchain","permalink":"https://pace-makers.github.io/tags/blockchain/"},{"name":"btc","slug":"btc","permalink":"https://pace-makers.github.io/tags/btc/"},{"name":"bitcointrading","slug":"bitcointrading","permalink":"https://pace-makers.github.io/tags/bitcointrading/"},{"name":"investment","slug":"investment","permalink":"https://pace-makers.github.io/tags/investment/"},{"name":"socket","slug":"socket","permalink":"https://pace-makers.github.io/tags/socket/"}]}