{"meta":{"title":"Pace Makers","subtitle":"This is Pace Makers blogging website.","description":"","author":"Pace Makers","url":"https://pace-makers.github.io","root":"/"},"pages":[],"posts":[{"title":"Realtime Console Chat App","slug":"realtime-console-chat-app","date":"2021-05-21T07:42:24.000Z","updated":"2021-05-21T07:47:43.812Z","comments":true,"path":"2021/05/21/realtime-console-chat-app/","link":"","permalink":"https://pace-makers.github.io/2021/05/21/realtime-console-chat-app/","excerpt":"In this post, We will create and see how easy it is to create your own realtime chat app in console. This chat app is two part, One part is server and second part is Client. What we need for this tutorial NPM and NodeJS installed socket.io and socket.io-client module Setting up our project","text":"In this post, We will create and see how easy it is to create your own realtime chat app in console. This chat app is two part, One part is server and second part is Client. What we need for this tutorial NPM and NodeJS installed socket.io and socket.io-client module Setting up our projectI will be creating my server and client on the same project, If you want to deploy your server code to your hosting provider you need to create seperate project.First, I created a directory named chat-cli and initialized npm project with npm init -y. Now I installed the required modules like socket.io and socket.io-client with npm install socket.io socket.io-client.I created two files in our project index.js(contains Client code) and server.js(contains Server code).Now let’s dive into more details. Creating a Socket.io serverWe need socket.io server to process all events and send it to our client. So, Let’s create it. Open your server.js file and Let’s write some code. 123456789101112131415161718192021222324252627// Created a socket.io serverconst io = require(&quot;socket.io&quot;)();// This should be a free port on our server.const PORT = process.env.PORT || 3000;// Created a empty user object, This will store names of our users.const users = &#123;&#125;;// Listening for a connection event (This event fires when a client is connected to your server)io.on(&quot;connection&quot;, (socket) =&gt; &#123; console.log(&quot;New Connection: &quot; + socket.id); // If user emitted a `new user` event, This callback will be called with his name. socket.on(&#x27;new user&#x27;, (name) =&gt; &#123; // Storing his name users[socket.id] = name; // Emitting an event to all users except that user. socket.broadcast.emit(&quot;message&quot;, `$&#123;name&#125; joined the chat.`) &#125;); // Listening for a `message` event. socket.on(&#x27;message&#x27;, (text) =&gt; &#123; // Emitting an event to all users except that user. socket.broadcast.emit(&quot;message&quot;, `$&#123;users[socket.id]&#125;&gt; $&#123;text&#125;`); &#125;);&#125;);// Starting up server on PORTio.listen(PORT); Now our server code is finished. Creating Client for ServerWe need to create client and let it connect to our server. Open up index.js file and Let’s write some code. 1234567891011121314151617181920212223242526272829303132333435363738// IMPORTING `socket.io-client` moduleconst io = require(&#x27;socket.io-client&#x27;);// Creating client at the server, you need to pass url of your server where you hosted it.const socket = io(&quot;http://localhost:3000&quot;);// IMPORTING readline module to read from console.const readline = require(&#x27;readline&#x27;);// Creating an interface to get input from our console.const rl = readline.createInterface(&#123; input: process.stdin,&#125;);// Getting users name.console.log(&quot;What is your name?&quot;);rl.question(&quot;What is your name?&quot;, (text) =&gt; &#123; // Sending users name to server socket.emit(&#x27;new user&#x27;, text.trim()); console.log(&quot;You joined the chat&quot;); process.stdout.write(&quot;&gt; &quot;);&#125;);// Listening for event `message` from our server (This will fire when server sends `message` event)socket.on(&quot;message&quot;, (text) =&gt; &#123; // Erasing Last line process.stdout.write(&quot;\\r\\x1b[K&quot;) console.log(text); process.stdout.write(&quot;&gt; &quot;);&#125;);// Prompting user to enter message.rl.prompt();// Fires when we input text from user.rl.on(&#x27;line&#x27;, (text) =&gt; &#123; // Sending message to our server. socket.emit(&#x27;message&#x27;, text.trim()); process.stdout.write(&quot;&gt; &quot;); rl.prompt();&#125;); Our client code is now finished. How to runFirst open up three terminals or cmd in your project directory, Start your server first by typing node server.js. Now run two clients you want to chat by typing node index.js on two terminals or cmd. If you have done everything correctly, You will be able to chat. Link to This Project Follow me on my socials","categories":[{"name":"Technology","slug":"Technology","permalink":"https://pace-makers.github.io/categories/Technology/"},{"name":"Programming","slug":"Technology/Programming","permalink":"https://pace-makers.github.io/categories/Technology/Programming/"}],"tags":[{"name":"nodejs","slug":"nodejs","permalink":"https://pace-makers.github.io/tags/nodejs/"},{"name":"javascript","slug":"javascript","permalink":"https://pace-makers.github.io/tags/javascript/"},{"name":"socket","slug":"socket","permalink":"https://pace-makers.github.io/tags/socket/"}]},{"title":"Misconceptions About Vaccines","slug":"misconceptions-about-vaccines","date":"2021-05-20T07:42:48.000Z","updated":"2021-05-20T11:09:43.995Z","comments":true,"path":"2021/05/20/misconceptions-about-vaccines/","link":"","permalink":"https://pace-makers.github.io/2021/05/20/misconceptions-about-vaccines/","excerpt":"In these tough times we are facing a lot of problem which is enormous in number. The pandemic has no solution other than Vaccines. So, why people fear This? Some people think is it safe so?will it result cause in any other severe problems?….. So hold on guyss Read this full article and we assure you at the end you will get your answers. So basically starting with “What are Vaccines and How do they really Work?”A vaccine is a biological preparation that improves immunity to a particular disease caused by any virus or bacteria. Mostly vaccines contain parts of microbes or whole microbes that have been killed or weakened so that they don’t cause any disease.When a person is Vaccinated, the immune system confronts these harmless versions of the germs. The immune system quickly clears them from the body.In turn the body remembers the germ so that later if they attack again the retained memory help to fight against the particular germ and that’s how it work. Starting with whether covid vaccines are safe or not, So from my point of view and considering those recommendatoions from W.H.O. these vaccines are the only first and last option we have right now.These may cause you several mild-to-moderate side effects when receiving vaccinations. This is because your immune system is instructing your body to react in certain ways: it increases blood flow so more immune cells can circulate, and it raises your body temperature in order to kill the virus. So bascially you may expose to some mild fever, headache or some body pain. And no such long term side effects shown yet mostly. Don’t fear within 10-14 days your immune system start to develop again and sooner you will be all normal again.","text":"In these tough times we are facing a lot of problem which is enormous in number. The pandemic has no solution other than Vaccines. So, why people fear This? Some people think is it safe so?will it result cause in any other severe problems?….. So hold on guyss Read this full article and we assure you at the end you will get your answers. So basically starting with “What are Vaccines and How do they really Work?”A vaccine is a biological preparation that improves immunity to a particular disease caused by any virus or bacteria. Mostly vaccines contain parts of microbes or whole microbes that have been killed or weakened so that they don’t cause any disease.When a person is Vaccinated, the immune system confronts these harmless versions of the germs. The immune system quickly clears them from the body.In turn the body remembers the germ so that later if they attack again the retained memory help to fight against the particular germ and that’s how it work. Starting with whether covid vaccines are safe or not, So from my point of view and considering those recommendatoions from W.H.O. these vaccines are the only first and last option we have right now.These may cause you several mild-to-moderate side effects when receiving vaccinations. This is because your immune system is instructing your body to react in certain ways: it increases blood flow so more immune cells can circulate, and it raises your body temperature in order to kill the virus. So bascially you may expose to some mild fever, headache or some body pain. And no such long term side effects shown yet mostly. Don’t fear within 10-14 days your immune system start to develop again and sooner you will be all normal again. Who should get the covid-19 vaccines?The COVID- 19 vaacines are safe to most of the people which are older than 18n years,including those to which fall under these category : hypertension, diabetes, asthma, pulmonary, liver and kidney disease, as well as chronic infections that are stable and controlled. Can we stop taking precautions after being vaccinated?Vaccinations protect you from those uncontrollable situation which cause multiple failure of organs and deaths, after 14 daysit start building up immuntiy. In between this time peiod one should take care of himself atmost,because in this time your immunity will be at the lowest. After that it gradually increases.Still there are lot of discussion is going on and to be reamined in safer zone we still needto follow our local guidelines, which is probably wearing mask and maintaining social distanceof 1 meter. Can I have the second dose with a different vaccine?NO specific data shows to use this type of comnbination and till the date WHO do not recommendso probably, my answer is no. However if any records or some positive results will be shownwe will let you know in comments. After getting vaccine can I get RT- PCR or antigen test positive?No, the RT- PCR or antigen test will not show the report positive, However,because the COVID-19 vaccine prompts an immune response, it may be possible to test positive in an antibody (serology) test that measures COVID-19 immunity in an individual. Should I be vaccinated if I had COVID-19 positive?The US’ Centres for Disease Control and Prevention (CDC) recommends that a person get vaccinated immediately after recovery, while the World Health Organization (WHO) states that a person should wait six months as natural antibodies seem to likely persist in the human body until then. What happens if I take the vaccine when I’m positive?“We do not currently have any evidence to say whether it is better or worse to get vaccinated when infected, whether in terms of immune response or any safety issue,” says Dr Kang. However, vaccinating after recovery acts like a booster shot, with previously infected people making a very strong response with the first dose of vaccine. What if I catch Covid in between two vaccine doses?You should wait for 3-4 weeks after recovery before you take the second dose. Can pregnant/lactating women take the vaccine?No such side effects shown yet to those who were pregnant or lactating womens.Based on data, it appears safe for pregnant and lactating women to take the currently available vaccines, says Kang. How long after the Covid shots should I take other vaccines?This changes from vaccine to vaccine you should concerns your local authority for this. Hope you all get enough information about this topic if any related issues or query you have write me on those comment below.Have a good day","categories":[],"tags":[]}],"categories":[{"name":"Technology","slug":"Technology","permalink":"https://pace-makers.github.io/categories/Technology/"},{"name":"Programming","slug":"Technology/Programming","permalink":"https://pace-makers.github.io/categories/Technology/Programming/"}],"tags":[{"name":"nodejs","slug":"nodejs","permalink":"https://pace-makers.github.io/tags/nodejs/"},{"name":"javascript","slug":"javascript","permalink":"https://pace-makers.github.io/tags/javascript/"},{"name":"socket","slug":"socket","permalink":"https://pace-makers.github.io/tags/socket/"}]}