{
    "version": "https://jsonfeed.org/version/1",
    "title": "Pace Makers • All posts by \"non imitated success\" tag",
    "description": "",
    "home_page_url": "https://pace-makers.github.io",
    "items": [
        {
            "id": "https://pace-makers.github.io/2021/05/27/How-should-we-start-something/",
            "url": "https://pace-makers.github.io/2021/05/27/How-should-we-start-something/",
            "title": "How Should We Start Something in Life ?",
            "date_published": "2021-05-27T05:04:28.000Z",
            "content_html": "<p><img src=\"/2021/05/27/How-should-we-start-something/banner.png\"></p>\n<p><code>The biggest question mark</code> in our life when we are going to start something new, something that leads to our future, something that we want to accomplish in our life.</p>\n<p>The word something can be different for person to person but the question mark always same for everyone <code>from where should I start?</code> ……….</p>\n<p>Daily we think about that something we used to google it trying to find the easiest way to accomplish that something watching thousands of things on YouTube, <code>10 minutes to get success type videos</code>, etc.</p>\n<p>The truth is that we always want a straight path to do something. Its like one day a magician will come and tell you that straight way first you have to do this then next step is this and then you will follow that straight path to get success or whatever you want.</p>\n<p><img src=\"/2021/05/27/How-should-we-start-something/banner2.png\"></p>\n<p>But the hidden truth is that is no straight path to accomplish your something. The question still here <code>from where should I start?</code> now we all searched about what we want to do you get millions of options start from here or somewhere else dont get confused every option is correct just randomly pick an option and start doing from there. Some of you think how does it work its called Pick one and gain everything.</p>\n<p>Now you have randomly picked an option you started from there you get a doubt in between that option what you will do you will search about it clear your doubt now again you got a doubt inside that doubt you will definitely going to clear this also..</p>\n<p>By this simple game getting doubt and clearing it. You will cover entire knowledge and experience of whatever you want to accomplish in your life and then the knowledge and experience you gain will automatically leads you towards your Success.</p>\n<p><img src=\"/2021/05/27/How-should-we-start-something/3.png\"></p>\n<p>Success is Endless the more you try the more you gain about it…</p>\n<p>Do not try to follow someone if you get Success by following someone you are not the right owner of that Success.</p>\n<p>You are the magician of your life you have to make your own path no one is going to tell you what you have to do. No one knows yourself better than You.</p>\n<p>So just make a Start doesn`t matter from where you start at the end you have to went through all the path…</p>\n<p>You can let me know your problems on instagram : <a href=\"https://www.instagram.com/hardc0d3d/\">https://www.instagram.com/hardc0d3d/</a></p>\n",
            "tags": [
                "Non imitated success",
                "Life",
                "New start",
                "Success",
                "study"
            ]
        }
    ]
}