{
    "version": "https://jsonfeed.org/version/1",
    "title": "Pace Makers • All posts by \"game\" tag",
    "description": "",
    "home_page_url": "https://pace-makers.github.io",
    "items": [
        {
            "id": "https://pace-makers.github.io/2021/05/26/Why-Indian-Parents-don-t-support-Gaming/",
            "url": "https://pace-makers.github.io/2021/05/26/Why-Indian-Parents-don-t-support-Gaming/",
            "title": "Why Indian Parents Don't Support Gaming?",
            "date_published": "2021-05-26T08:52:10.000Z",
            "content_html": "<p><img src=\"https://i0.wp.com/post.medicalnewstoday.com/wp-content/uploads/sites/3/2020/09/GettyImages-1097026358_header-1024x575.jpg?w=1155&h=1528\" alt=\"THUMBNAIL\"></p>\n<h1 id=\"What-is-Gaming-The-definition-of-Gaming\"><a href=\"#What-is-Gaming-The-definition-of-Gaming\" class=\"headerlink\" title=\"What is Gaming? The definition of Gaming!\"></a>What is Gaming? The definition of Gaming!</h1><p>I am refering gaming here as in a professional gamer, or an esports athlete, etc. I’m talking about a real gamer who has passion to grow and win games and go pro. Now to answer this question we need to understand it by the perspective of a typical parent in India. There are many reasons behind this and I am listing them below.</p>\n<h2 id=\"The-History\"><a href=\"#The-History\" class=\"headerlink\" title=\"The History\"></a>The History</h2><p><img src=\"http://nie-images.s3.amazonaws.com/gall_content/2018/9/2018_9$largeimg25_Sep_2018_134726380.jpg\" alt=\"THE-HISTORY\"></p>\n<p>As a developing country, earlier we(Indians) didnt have the privelege to choose our jobs. Those who studied and became engineer, doctor, etc were the only successful people in India. So our parents when they were younger were told the same things as we are told. Our parents unlike us, used to play outdoor games. So their parents told them that this is waste of time. Instead they should read books and study in that time to become successful. Studying was the only option to become successful. That’s why our parents tell us that gaming is waste of time and instead we should study and become successful.</p>\n<h2 id=\"The-Unawareness\"><a href=\"#The-Unawareness\" class=\"headerlink\" title=\"The Unawareness\"></a>The Unawareness</h2><p>As the times have changed now and many Indian gamers are emerging and representing our country internationally, there is a small amount of scope in gaming. It is not fully changed, but to some extent it has changed. And our parents still think that this is a waste of time. We have to let them know about the current situation and convince them.</p>\n<h2 id=\"Gaming-is-expensive\"><a href=\"#Gaming-is-expensive\" class=\"headerlink\" title=\"Gaming is expensive!\"></a>Gaming is expensive!</h2><p><img src=\"https://images.moneycontrol.com/static-mcnews/2018/06/shutterstock_526404799-1-770x433.jpg?impolicy=website&width=770&height=431\" alt=\"MONEY\"></p>\n<p>As we all know gaming in India is “EXPENSIVE”. And by expensive I mean very expensive (as compared to other countries). Most of the parents can’t afford these expensive graphic cards, gaming consoles, Processors, good peripherals, etc. Even the games are also quite expensive. So when we go to our parents and tell them that we want a pc/console, we are putting burden on them (as most families are middle class and cannot afford). Also as we are pursuing gaming as a career, it  is seen as an investment. So parents are scared if they didn’t get the return and all their money got wasted.</p>\n<h2 id=\"Toxicity-in-India-Gaming\"><a href=\"#Toxicity-in-India-Gaming\" class=\"headerlink\" title=\"Toxicity in India Gaming!\"></a>Toxicity in India Gaming!</h2><p><img src=\"https://ucsdguardian.org/wp-content/uploads/2018/05/raging-gamer-752x440.png\" alt=\"ABUSING\"></p>\n<p>If you tell your parents you want to pursue gaming as profession, they might do a bit of R&amp;D on gaming. And what they would find in the Indian gaming community you know very well. “Toxicity”. Yes Indian gaming community is toxic. When I play Valorant or Pubg mobile and queue solo, I mute all the teammates most of the time. Because either they will try to demotivate you or sabotage you in game. That is not entirely their fault. Our famous gaming youtubers use abusive language on their streams and people enjoy it follow them. And parents are afraid of that toxicity, aggression, etc. That is also a major reason of not supporting gaming in India.</p>\n<h2 id=\"Success-is-not-guaranteed\"><a href=\"#Success-is-not-guaranteed\" class=\"headerlink\" title=\"Success is not guaranteed!\"></a>Success is not guaranteed!</h2><p><img src=\"http://www.betterlifeliving.com.au/wp-content/uploads/2019/06/Guaranteed-Success-in-Any-Endeavor.jpeg\" alt=\"SUCCESS\"></p>\n<p>Gaming is like entrepreneurship. Success is not guaranteed. And parents are concerned about their children and their future. As we discussed in history, entreprenuership was also not considered a good thing earlier. As a poor country parents wanted guranteed success for their children, and hence wanted their children to get a good job and settle accordingly. Therefore our parents want the same for us, i.e, get a good job and settle your life, instead of take risks and set up a business (here gaming).</p>\n<h2 id=\"Solution-For-the-Gamers\"><a href=\"#Solution-For-the-Gamers\" class=\"headerlink\" title=\"Solution For the Gamers\"></a>Solution For the Gamers</h2><p><img src=\"https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2018/10/childrens-expectations-760x399.png\" alt=\"PARENTS\"></p>\n<p>When you were younger, could not walk by yourself, couldn’t speak, everything was taught to you by your parents. So why can’t you explain everything to them with kind and polite words instead of arguing and demanding pcs and consoles.</p>\n<p>You have to take all their questions and answer them by expaining everything. You have to assure them by studying side by side and gaming when you are free.</p>\n<p>I know gaming takes time, but for your parents you have to split time and do all the things side by side gaming. You can start a little earning and build a pc by yourself (ofcourse you can take some help of money from parents but try not to put burden on them). Just as your parents sacrificed many things for you, you can sacrifice some things and study/work side by side gaming to assure them.</p>\n<p>You have to convince them that every gamer is not the same, and every gamer is not toxic. </p>\n<p>Try to understand them, they are your parents, if you’ll try a little they will understand you completely. Build trust and never break it. Be honest with yourself.</p>\n<p>Good luck with your future I hope you and me both succeed together in life.</p>\n<p>Thank You for reading my blog!</p>\n<p>Follow me on Instagram - <a href=\"https://instagram.com/raunaq_soneja\">https://instagram.com/raunaq_soneja</a><br>For gaming content subscribe to my Youtube Channel - <a href=\"https://www.youtube.com/channel/UCB5W2a5sH6LiS7Uv73Dls7w\">https://www.youtube.com/channel/UCB5W2a5sH6LiS7Uv73Dls7w</a><br>Follow me on twitter - <a href=\"https://twitter.com/raunaq_soneja\">https://twitter.com/raunaq_soneja</a></p>\n",
            "tags": [
                "Gaming",
                "Indian",
                "Parents",
                "Money",
                "Game"
            ]
        }
    ]
}