{
    "version": "https://jsonfeed.org/version/1",
    "title": "Pace Makers • All posts by \"health\" category",
    "description": "",
    "home_page_url": "https://pace-makers.github.io",
    "items": [
        {
            "id": "https://pace-makers.github.io/2021/05/23/truth-about-black-fungus/",
            "url": "https://pace-makers.github.io/2021/05/23/truth-about-black-fungus/",
            "title": "Black Fungus - What Is Mucormycosis, Its Symptoms and Treatment?",
            "date_published": "2021-05-23T07:47:57.000Z",
            "content_html": "<p><img src=\"https://s.france24.com/media/display/6ff09d48-b959-11eb-b4ae-005056bf87d6/w:1280/p:16x9/d128e73ae63b43ddd8e5cfede755e073d9538cf6.webp\"></p>\n<h2 id=\"What-is-Mucormycosis\"><a href=\"#What-is-Mucormycosis\" class=\"headerlink\" title=\"What is Mucormycosis?\"></a>What is Mucormycosis?</h2><p>Mucormycosis is also known as Black fungus is a rare but dangerous <code>fungual infection</code> among <code>covid19 patients</code>, which often manifests in the skin and also affects the lungs and the brain. It is caused by a group of moulds known as <code>mucormycetes</code> present naturally in the environment.<br> Black fungus infections have been detected in <code>Karnataka</code>, <code>Uttarakhand</code>, <code>Telangana</code>, <code>Madhya Pradesh</code>, <code>Andhra Pradesh</code>, <code>Haryana</code> and <code>Bihar</code>. States like Rajasthan have already declared this disease as an epidemic.</p>\n<h2 id=\"How-we-come-in-contact-with-Black-Fungus\"><a href=\"#How-we-come-in-contact-with-Black-Fungus\" class=\"headerlink\" title=\"How we come in contact with Black Fungus?\"></a>How we come in contact with Black Fungus?</h2><p> Primarily, fungal spore floating in the environment give people this infection. One may also catch it when the fungus <code>enters the skin through a cut, burn, or other types of skin trauma.</code><br> If the fungus goes in through a cut or a burn, it can cause local infections. But if it goes in through the <code>sinus</code>, it can affect the eyes and eventually, the brain, leading to a fatal situation.<br> Mucormycosis can lead to loss of the upper jaw and sometimes even the eye.</p>\n<h2 id=\"Symptoms-of-mucormycosis\"><a href=\"#Symptoms-of-mucormycosis\" class=\"headerlink\" title=\"Symptoms of mucormycosis\"></a>Symptoms of mucormycosis</h2><p> Some common symptoms include pain and redness around the eyes or nose, with fever, headache, coughing, shortness of breath, bloody vomits, and altered mental status.<br> According to the Experts, this infection should be suspected when there is:</p>\n<ol>\n<li>nasal blockade or congestion, nasal discharge (blackish/bloody)</li>\n<li> Local pain on the cheek bone, one-sided facial pain, numbness or swelling</li>\n<li> Blackish discoloration over bridge of nose/palate</li>\n<li> Loosening of teeth, jaw involvement</li>\n<li> Blurred or double vision with pain</li>\n<li> Thrombosis, necrosis, skin lesion</li>\n<li> Chest pain, pleural effusion, worsening of respiratory symptoms.</li>\n</ol>\n<h1 id=\"Treatment-of-mucormycosis\"><a href=\"#Treatment-of-mucormycosis\" class=\"headerlink\" title=\"Treatment of mucormycosis\"></a>Treatment of mucormycosis</h1><p>It is generally treated with antifungals but may require surgery. According to doctors, it is very important to control diabetes, reduce the use of steroids, and discontinue immunomodulating drugs.</p>\n<p><img src=\"https://5.imimg.com/data5/DI/FS/MY-58417962/liposomal-amphotericin-b-injection-ip-50mg-500x500.jpg\"></p>\n<p>The initial recommended antifungal treatment is given through a vein(IV) for at least 4-6 weeks before infusion of <code>amphotericin B</code> and antifungal therapy.<br>Currently, Amphotericin B is being used by doctors to treat black fungus but now, there is a shortage of Amphotericin B drugs, so doctors are moving to second-line drugs like <code>Posaconazole</code>.</p>\n<p>In severe cases, doctor may recommend surgery to remove infected or dead tissue to stop the fungus from spreading. This might include removing parts of your nose or eyes.</p>\n<p>Treating black fungus among patients, where it is undetected for long, requires a team of microbiologists, internal medicine specialists, intensivist neurologists, ENT specialists, ophthalmologists, dentists, surgeons, etc. </p>\n<h1 id=\"Death-Rate-of-Mucormycosis\"><a href=\"#Death-Rate-of-Mucormycosis\" class=\"headerlink\" title=\"Death Rate of Mucormycosis\"></a>Death Rate of Mucormycosis</h1><p>Researchers estimate a mortality rate as high as 80% if left untreated for long but if treated,  still the death rate is around 54%.</p>\n<h1 id=\"Prevention\"><a href=\"#Prevention\" class=\"headerlink\" title=\"Prevention\"></a>Prevention</h1><ol>\n<li>Stay away from areas with a lot of <code>dust</code> or <code>soil</code>, like construction or evacuation site.<br>Always wear a mask like <code>N-95</code>.</li>\n<li>Avoid <code>infected water</code> – floodwater or water-damaged buildings, especially after naturaldisasters like hurricanes or floods.</li>\n<li>If you have a weakened immune system, avoid activities that involve dust and soil, like gardening or yard work.</li>\n<li>After Covid-19 treatment , control <code>diabetes</code> and monitor <code>blood glucose level</code>.</li>\n</ol>\n<p>Thanks for Reading, Stay Safe.<br><a href=\"https://instagram.com/ruksh11\">Follow me on Instagram</a></p>\n<p>Stay Tuned for more content</p>\n",
            "tags": [
                "blackfungus",
                "mucormycosis",
                "symptoms",
                "treatment",
                "deathrate",
                "prevention"
            ]
        }
    ]
}